<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<html>

<head>
<meta http-equiv="Content-Type"
content="text/html; charset=iso-8859-1">
<title>Capítulo 6: Classes e Objetos</title>
</head>

<body bgcolor="#FFF4EE" text="#1F1810" link="#FF4000"
vlink="#6F0000" alink="#FFFF00">
<style type="text/css"><!--
       dd {font-size: 10pt; font-family: Arial, Helvetica, sans-serif}
   a:link {text-decoration: none; font-size: 10pt; font-family: Arial, Helvetica, sans-serif}
  a:vlink {text-decoration: none; font-size: 10pt; font-family: Arial, Helvetica, sans-serif}
       h2 {font-size: 16pt; font-weight: bold; font-family: Arial, Helvetica, sans-serif}
      big {font-size: 100pt; font-weight: bold; font-family: Times, Times New Roman, serif}
        u {background: cccc99; font-size: 10pt; font-family: Arial, Helvetica, sans-serif}
    small {font-size:8pt}
--></style><script>
</script>

<table border="5" width="100%">
    <tr>
        <td align="center" bgcolor="#EECCAA"><a
        href="http://www.dsc.ufpb.br/~helder"><font size="2"
        face="Arial, Helvetica">Helder's Web</font></a> </td>
        <td align="center" bgcolor="#FFDECC"><a
        href="/~helder/java/"><font size="2"
        face="Arial, Helvetica">Recursos Java</font></a> </td>
        <td align="center" bgcolor="#EECCAA"><a
        href="http://www.dsc.ufpb.br/"><font size="2"
        face="Arial, Helvetica">DSC/UFPB</font></a> </td>
    </tr>
</table>

<p>&nbsp; </p>

<table border="0" cellpadding="0" cellspacing="0" width="540">
    <tr>
        <td><div align="right"><table border="0" width="400">
            <tr>
                <td align="right"><h1><font color="#804000"
                size="7"><i>Classes e <br>Objetos</i></font><i><br>
                </i></h1>
                <hr>
                </td>
            </tr>
        </table>
        </div></td>
    </tr>
    <tr>
        <td height="10"><table border="1" cellpadding="0"
        cellspacing="0" width="190">
            <tr>
                <td align="center"><a
                href="http://www.dsc.ufpb.br/~helder"><font
                size="2" face="arial, helvetica">H<small>ELDER</small></font><font
                size="2"> L. S. <small>DA</small> R<small>OCHA</small></font></a></td>
            </tr>
        </table>
        </td>
    </tr>
</table>

<table border="0" width="540">
    <tr>
        <td>....................</td>
        <td>&nbsp;</td>
    </tr>
    <tr>
        <td>&nbsp;</td>
        <td>

Nos cap&iacute;tulos anteriores, descrevemos a estrutura da linguagem Java
sem entrar em detalhes quanto &agrave; sua natureza orientada a objetos.
Neste cap&iacute;tulo, abordaremos de maneira mais detalhada a cria&ccedil;&atilde;o,
uso e destrui&ccedil;&atilde;o de classes e objetos.&nbsp;
<BR>
<BR>Como vimos no cap&iacute;tulo 2, uma classe &eacute; um <I>gabarito</I>
que define os dados e m&eacute;todos comuns a todos os objetos do seu tipo.
Desta forma, a classe caracteriza uma qualidade, ou <I>tipo</I> de um objeto.
Vari&aacute;veis (campos de dados) podem ent&atilde;o ser declaradas como
sendo do &quot;tipo&quot; de uma determinada classe da mesma maneira que
se declara os tipos primitivos. Por exemplo:&nbsp;

<blockquote><table width="100%">
<TR>
<TD WIDTH=453>
<PRE><TT><FONT COLOR="#0000FF">long</FONT> pre&ccedil;o; </TT><FONT COLOR="#008000">// pre&ccedil;o &eacute; vari&aacute;vel do tipo primitivo <B>long</B></FONT>&nbsp;
Cessna ppHLZ; <FONT COLOR="#008000">// ppHLZ &eacute; vari&aacute;vel do tipo <B>Cessna&nbsp;</B></FONT>&nbsp;
String nome; <FONT COLOR="#008000">// nome &eacute; vari&aacute;vel do tipo <B>String&nbsp;</B></FONT>&nbsp;
C&iacute;rculo c; <FONT COLOR="#008000">// c &eacute; vari&aacute;vel do tipo <B>C&iacute;rculo</B></FONT>&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>
As declara&ccedil;&otilde;es acima <I>n&atilde;o criam</I> os objetos ppHLZ,
c e nome mas apenas <I>declaram</I> essas vari&aacute;veis como sendo do
tipo Cessna, String e C&iacute;rculo respectivamente, preparando estas
vari&aacute;veis a receberem refer&ecirc;ncias a objetos desses tipos.
A declara&ccedil;&atilde;o&nbsp;

<blockquote><table width="100%">
<TR>
<TD>
<PRE><FONT COLOR="#0000FF">long</FONT> pre&ccedil;o&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>
estabelece que a vari&aacute;vel pre&ccedil;o est&aacute; preparada para
receber um valor num&eacute;rico inteiro do tipo long. O seu conte&uacute;do
ser&aacute; &quot; 0&quot; (zero) enquanto n&atilde;o houver uma atribui&ccedil;&atilde;o,
<I>definindo</I> o valor da vari&aacute;vel, por exemplo:&nbsp;

<blockquote><table width="100%">
<TR>
<TD>
<PRE>pre&ccedil;o = 35700;&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>

A cria&ccedil;&atilde;o de um objeto &eacute; mais complexa do que a defini&ccedil;&atilde;o
de valores primitivos, portanto exige a invoca&ccedil;&atilde;o de um m&eacute;todo
construtor que ir&aacute; dizer como se constr&oacute;i o referido objeto.
Por este motivo, o objeto s&oacute; &eacute; criado ap&oacute;s a invoca&ccedil;&atilde;o
deste m&eacute;todo, que aloca a quantidade de mem&oacute;ria necess&aacute;ria
para ele. A vari&aacute;vel declarada anteriormente recebe ent&atilde;o,
por atribui&ccedil;&atilde;o, uma refer&ecirc;ncia para este objeto:&nbsp;

<blockquote><table width="100%">
<TR>
<TD>
<PRE>ppHLZ = <FONT COLOR="#0000FF">new</FONT> Cessna();&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>
Cessna() &eacute; o m&eacute;todo construtor e new, uma palavra reservada
usada na cria&ccedil;&atilde;o de novos objetos. Em uma se&ccedil;&atilde;o
mais adiante, voltaremos a este t&oacute;pico, mostrando outras formas
de cria&ccedil;&atilde;o de objetos.&nbsp;

</td></tr>

<tr><td colspan="2">
<h2><font face="arial, helvetica" color="000060"><i><br>
Criação de Classes</i></font></h2>
</td></tr>
<tr><td>&nbsp;</td><td>

Uma classe consiste basicamente de campos de dados e m&eacute;todos. Os
campos de dados s&atilde;o vari&aacute;veis ou constantes e os m&eacute;todos
cont&eacute;m o c&oacute;digo com as instru&ccedil;&otilde;es que manipulam
os dados. Estes dois ingredientes permitem a cria&ccedil;&atilde;o de objetos
com um certo estado (descrito nas vari&aacute;veis) e comportamento (definido
pelos m&eacute;todos).&nbsp;
<BR>
<BR>A forma mais simples de se criar uma classe em Java &eacute; usando a palavra-chave
class seguida por um identificador que serve de nome para a classe. O corpo
da classe &eacute; totalmente delimitado por chaves, cont&eacute;m as declara&ccedil;&otilde;es
dos campos de dados e m&eacute;todos.&nbsp;

<blockquote><table width="100%">
<TR>
<TD>
<PRE><FONT COLOR="#0000FF">class</FONT> Nome_da_classe {&nbsp;
&nbsp;&nbsp;&nbsp; declara&ccedil;&atilde;o/defini&ccedil;&atilde;o de campos (...)
&nbsp;&nbsp;&nbsp; declara&ccedil;&atilde;o/defini&ccedil;&atilde;o de m&eacute;todos (...)
}&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>
Por exemplo, a classe Cessna, que representamos esquematicamente no cap&iacute;tulo
2, poderia ser definida inicialmente da seguinte forma:&nbsp;

<p><table border="1" bgcolor="#eeeeee" width=100%>
<TR>
<TD>
<PRE><FONT COLOR="#0000FF">class</FONT> Cessna {&nbsp;
<FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp; private int</FONT> dire&ccedil;&atilde;o;&nbsp;
<FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp; private float</FONT> altitude;&nbsp;
<FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp; private float</FONT> velocidade;&nbsp;</PRE>

<PRE><FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp; public void</FONT> elevador(<FONT COLOR="#0000FF">int</FONT> posi&ccedil;&atilde;o) {&nbsp;
<FONT COLOR="#008000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // instru&ccedil;&otilde;es para mudar</FONT>&nbsp;
<FONT COLOR="#008000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // posi&ccedil;&atilde;o do elevador&nbsp;</FONT>&nbsp;
&nbsp;&nbsp;&nbsp; }&nbsp;</PRE>

<PRE><FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp; public void</FONT> leme(<FONT COLOR="#0000FF">int</FONT> posi&ccedil;&atilde;o) {&nbsp;
<FONT COLOR="#008000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // instru&ccedil;&otilde;es para mudar</FONT>&nbsp;
<FONT COLOR="#008000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // posi&ccedil;&atilde;o do leme</FONT>&nbsp;
<FONT COLOR="#008000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </FONT>}&nbsp;</PRE>

<PRE><FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp; public boolean</FONT> partida() {&nbsp;
<FONT COLOR="#008000">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; // instru&ccedil;&otilde;es para dar partida
</FONT><FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; return</FONT> true; <FONT COLOR="#008000">// partida foi dada</FONT>&nbsp;
&nbsp;&nbsp;&nbsp; }&nbsp;</PRE>

<PRE><FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp; public float</FONT> altimetro() {
<FONT COLOR="#0000FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; return</FONT> altitude;&nbsp;
&nbsp;&nbsp;&nbsp; }&nbsp;
}&nbsp;</PRE>
</TD>
</TR>
</TABLE>
<CENTER><IMG SRC="f61.gif" HEIGHT=191 WIDTH=323></CENTER>

<BR>Nesta defini&ccedil;&atilde;o h&aacute; tr&ecirc;s vari&aacute;veis de
<I>inst&acirc;ncia</I> e quatro m&eacute;todos (a ordem n&atilde;o
&eacute; importante). As vari&aacute;veis s&atilde;o privativas &agrave;
classe, ou seja, n&atilde;o s&atilde;o acess&iacute;veis quando se utiliza
um objeto do tipo <TT>Cessna</TT>. A &uacute;nica forma de se obter um registro
da altitude do avi&atilde;o, por exemplo, &eacute; atrav&eacute;s da invoca&ccedil;&atilde;o
do m&eacute;todo alt&iacute;metro(), que, como os outros m&eacute;todos
desta classe, &eacute; publicamente acess&iacute;vel. Poder&iacute;amos
usar o seguinte diagrama para representar a classe Cessna acima:&nbsp;
<BR>
<BR>Observe que, neste modelo, n&atilde;o &eacute; poss&iacute;vel para
um outro objeto (do tipo <TT>Piloto</TT>, por exemplo) saber a velocidade do
avi&atilde;o criado com esta classe, pois n&atilde;o criamos um m&eacute;todo
veloc&iacute;metro() que retornasse o valor da vari&aacute;vel velocidade.
S&oacute; o que &eacute; vis&iacute;vel de fora da classe s&atilde;o os
quatro m&eacute;todos.&nbsp;
<BR>
<BR>&Eacute; ainda poss&iacute;vel usar muitos outros m&eacute;todos n&atilde;o
definidos nesta classe como <TT>equals()</TT>, clone(), etc. De onde eles vem?
Da superclasse Object! Veremos mais sobre extens&atilde;o de classes no
cap&iacute;tulo seguinte, mas &eacute; importante lembrar (do cap&iacute;tulo
3) que toda classe em Java &eacute; a extens&atilde;o de uma classe de
n&iacute;vel mais alto na hierarquia. Se esta classe n&atilde;o &eacute;
especificada (como nos nossos exemplos at&eacute; agora), ela &eacute;
subclasse da classe Object, que ocupa o n&iacute;vel mais alto da hierarquia
e faz parte da biblioteca fundamental da linguagem Java.&nbsp;
<BR>
<BR>Toda declara&ccedil;&atilde;o de vari&aacute;vel obrigatoriamente deve
informar o seu tipo. No exemplo acima, temos uma vari&aacute;vel do tipo
<TT>int</TT> e duas do tipo float. Os m&eacute;todos, por sua vez, devem informar
o <I>tipo que retornam</I> e caso n&atilde;o retornem valor algum devem
ser declarados como void. &Eacute; o caso do m&eacute;todo leme(), no exemplo
acima, que s&oacute; trata de mudar a posi&ccedil;&atilde;o do leme e n&atilde;o
retorna informa&ccedil;&atilde;o alguma.&nbsp;
<BR>
<BR>A sintaxe geral para a declara&ccedil;&atilde;o de vari&aacute;veis
&eacute; a seguinte:&nbsp;

<blockquote><table width="100%">
<TR>
<TD>
<PRE><I>[</I><FONT COLOR="#0000FF">modificadores</FONT> ] <FONT COLOR="#0000FF">tipo</FONT> <B>nome_da vari&aacute;vel</B>;&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>
Os modificadores s&atilde;o opcionais. Podem modificar a visibilidade (acesso)
de uma vari&aacute;vel ou a sua qualidade. Os modificadores de visibilidade
s&atilde;o: public, private e protected, que definem que outras classes
e objetos podem acessar a vari&aacute;vel. As vari&aacute;veis do nosso
exemplo foram declaradas private, portanto n&atilde;o s&atilde;o vis&iacute;veis
de fora do objeto, a n&atilde;o ser que, como fizemos com a vari&aacute;vel
altitude, o seu valor seja repassado atrav&eacute;s de um m&eacute;todo
p&uacute;blico.&nbsp;
<BR>
<BR>Os modificadores de qualidade para vari&aacute;veis s&atilde;o:&nbsp;

<UL>
<LI>
<B>final</B>: define uma constante. Na declara&ccedil;&atilde;o de
uma constante, o seu valor j&aacute; deve ser definido. Por exemplo, poder&iacute;amos
ter em um programa que calcula &oacute;rbitas de sat&eacute;lite, a gravidade
da Terra ao n&iacute;vel do mar em m/s:&nbsp;</LI>

<blockquote><table width="100%">
<TR>
<TD>
<PRE><FONT COLOR="#0000FF">public final</FONT> g = 9.810;&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>

<LI>
<B>static</B>: usado para declarar vari&aacute;veis est&aacute;ticas
ou globais que s&atilde;o acess&iacute;veis somente atrav&eacute;s da classe
e independente da cria&ccedil;&atilde;o de objetos.&nbsp;</LI>
</UL>
A sintaxe geral para a declara&ccedil;&atilde;o de m&eacute;todos &eacute;
a seguinte:&nbsp;

<blockquote><table width="100%">
<TR>
<TD>
<PRE><I>[</I><FONT COLOR="#0000FF">modificadores ... </FONT> ]
<FONT COLOR="#0000FF">tipo_de_retorno</FONT>
<B>nome_do_m&eacute;todo</B> (<I>[<FONT COLOR="#0000FF">tipo</FONT> argumento, </I><FONT COLOR="#0000FF">tipo</FONT> argumento, ...] )
<I>[</I><FONT COLOR="#0000FF">throws</FONT><I> Exce&ccedil;&atilde;o]</I> { ... }&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>
O que est&aacute; entre [ e ] &eacute; opcional. Os modificadores podem
modificar a visibilidade (acesso) de um m&eacute;todo ou a sua qualidade.
Os modificadores de visibilidade s&atilde;o: public, private e protected,
que definem que outras classes e objetos podem acessar o m&eacute;todo.
Todos os m&eacute;todos do nosso exemplo s&atilde;o p&uacute;blicos, por
isso s&atilde;o acess&iacute;veis de fora.&nbsp;
<BR>
<BR>Veremos os modificadores de visibilidade (ou acesso) em mais detalhes no
pr&oacute;ximo cap&iacute;tulo.&nbsp;
<BR>
<BR>Os modificadores de qualidade para m&eacute;todos s&atilde;o:&nbsp;

<UL>
<LI>
<B>final</B>: faz com que a implementa&ccedil;&atilde;o do m&eacute;todo
seja uma vers&atilde;o final e n&atilde;o possa ser sobreposto em uma sub-classe,
ou seja, se defin&iacute;ssemos Cessna como sub-classe de Monomotor, eu
tivesse um m&eacute;todo alt&iacute;metro() definido nesta classe como
final, eu n&atilde;o poderia redefin&iacute;-lo em Cessna.&nbsp;</LI>

<LI>
<B>abstract</B>: usado para definir um m&eacute;todo sem implementa&ccedil;&atilde;o,
que necessariamente precisa ser sobreposto em uma sub-classe para que possa
ser usado. Por exemplo, declarando o m&eacute;todo partida() como abstract
em Avi&atilde;o, tornar&aacute; sua implementa&ccedil;&atilde;o obrigat&oacute;ria
nas subclasses (todo avi&atilde;o deve ter um meio de dar partida) de uma
forma particular a cada caso.&nbsp;</LI>

<LI>
<B>native</B>: declara um m&eacute;todo que usa uma implementa&ccedil;&atilde;o
escrita em outra linguagem (C ou C++, por exemplo).&nbsp;</LI>

<LI>
<B>static</B>: usado para declarar um m&eacute;todo pertencente &agrave;
classe que n&atilde;o &eacute; herdado pelos objetos criados por ela. Pode
ser invocado unicamente atrav&eacute;s da pr&oacute;pria classe e age como
uma fun&ccedil;&atilde;o independente.&nbsp;</LI>

<LI>
<B>synchronized</B>: em programas que usam <I>multithreading</I>, este
modificador garante que os dados manipulados pelo m&eacute;todo n&atilde;o
ser&atilde;o modificados por outro m&eacute;todo enquanto este n&atilde;o
terminar de us&aacute;-los.&nbsp;</LI>
</UL>
A cl&aacute;usula throws &eacute; usada quando um m&eacute;todo causa uma
exce&ccedil;&atilde;o que n&atilde;o &eacute; capturada e tratada dentro
do mesmo. &Eacute; necess&aacute;ria esta declara&ccedil;&atilde;o para
que os programas que usem o m&eacute;todo possam tentar capturar a exce&ccedil;&atilde;o
ou pass&aacute;-la adiante.&nbsp;
<BR>
<BR>O nome do m&eacute;todo deve sempre ser seguido de par&ecirc;nteses, mesmo
se n&atilde;o houver argumentos. Se houver, o tipo deles deve ser declarado.
Os argumentos s&atilde;o separados por v&iacute;rgulas. Toda a implementa&ccedil;&atilde;o
do m&eacute;todo deve vir entre as chaves { e } a menos que seja declarado
abstract ou native. Neste caso, a declara&ccedil;&atilde;o deve terminar
com um ponto-e-v&iacute;rgula:&nbsp;

<blockquote><table width="100%">
<TR>
<TD WIDTH=453>
<PRE><FONT COLOR="#0000FF">public abstract boolean</FONT> <B>partida</B>();
<FONT COLOR="#0000FF">private native double</FONT>
         <B>integral</B>(<FONT COLOR="#0000FF">float</FONT> expr, <FONT COLOR="#0000FF">double</FONT> sup, <FONT COLOR="#0000FF">double</FONT> inf);&nbsp;</PRE>
</TD>
</TR>
</TABLE></blockquote>

</td></tr>

<tr><td colspan="2">
<h2><font face="arial, helvetica" color="000060"><i><br>
Exercícios</i></font></h2>
</td></tr>
<tr><td>&nbsp;</td><td>

<OL>
<LI>
Implemente um m&eacute;todo veloc&iacute;metro(), para Cessna, que
leia a vari&aacute;vel velocidade e um m&eacute;todo b&uacute;ssola() que
leia a vari&aacute;vel dire&ccedil;&atilde;o.&nbsp;</LI>

<LI>
Crie uma classe C&iacute;rculo que tenha as vari&aacute;veis x, y (coordenadas
do centro) e raio. Todas devem ser p&uacute;blicas e de ponto-flutuante
de simples precis&atilde;o (float). Implemente 2 m&eacute;todos para o
C&iacute;rculo: area() e circunfer&ecirc;ncia(). Ambos s&atilde;o p&uacute;blicos
e devem retornar os valores como float. <I>F&oacute;rmulas do c&iacute;rculo</I>:
&Aacute;rea = <FONT FACE="Symbol">p</FONT> * <I>raio</I><SUP>2</SUP>; Circunfer&ecirc;ncia
= 2 * <FONT FACE="Symbol">p</FONT> * <I>raio</I>.&nbsp;</LI>

<LI>
Quais as vantagens e desvantagens de se ter vari&aacute;veis p&uacute;blicas,
como as do exerc&iacute;cio 2?&nbsp;</LI>
</OL>

        <p align="right"><a name="end"></a><a href="Cap_6b.html"><b>Continua... (fim da parte 1/4)</b></a></p>


</td></tr>

</table>

<hr>

<p align="center"><font size="2">&copy; 1996 </font><a href="http://www.dsc.ufpb.br/~helder"><font
size="2">Helder L. S. da Rocha</font></a><font size="2"> </font></p>

<table border="5" width="100%">
    <tr>
        <td align="center" bgcolor="#EECCAA"><a
        href="http://www.dsc.ufpb.br/~helder"><font size="2"
        face="Arial, Helvetica">Helder's Web</font></a> </td>
        <td align="center" bgcolor="#FFDECC"><a
        href="/~helder/java/"><font size="2"
        face="Arial, Helvetica">Recursos Java</font></a> </td>
        <td align="center" bgcolor="#EECCAA"><a
        href="http://www.dsc.ufpb.br/"><font size="2"
        face="Arial, Helvetica">DSC/UFPB</font></a> </td>
    </tr>
</table>
</body>
</html>
